"""
ООП - это парадигма при которой код выстраиваться в виде совокупности объектов,
которые принадлежат классам, а классы выстраивают иерархию наследования

4 парадигмы ООП

Абстракция - мы в коде используем только те характеристики объекта,
которые нам важны конкретно в данном коде, то есть в реальном мире
объект может иметь миллион характеристик, но мы будем работать только
с теми, которые нам важны.

Наследование - один класс может строиться на основе другого класса,
один будет родительским, другой будет дочерним. Дочерний класс получает
всё от родительского класса (атрибуты, методы...)

Инкапсуляция - в программировании понимается двояко. Фундаментально инкапсуляция
подразумевает что мы в класс инкапсулируем все атрибуты и методы котрые 
связаны общей идеей. Второй тип подразумевает сокрытие данных. В классах
должны быть приватные или протектед атрибуты. Из класса выставлять наружу только
те интерфейсы, которые нужны пользователю.

Полиморфизм подразумевает, что при наследовании мы можем не просто брать
от родителей все атрибуты и меотды, но также перегружать их под свои нужды.
"""